app/controllers/complains_controller.rb

  def index
    @complains = Complain.all
---
SELECT `complains`.* FROM `complains`

  def adm
     @complains = Complain.all
---
SELECT `complains`.* FROM `complains`

  def user
    @complains = Complain.where(:user_id => current_user.id)
---
SELECT `complains`.* FROM `complains` WHERE `complains`.`user_id` = 1

  def create
    @complain = Complain.new(complain_params)
    @complain.user_id = current_user.id


    respond_to do |format|
      if @complain.save
---
INSERT INTO `complains` (`name`, `subject`, `complain`, `created_at`, `updated_at`, `user_id`) VALUES ('av', 'sf', 'sdf', '2018-12-27 19:37:44', '2018-12-27 19:37:44', 1)

  def destroy
    @complain.destroy
---
DELETE FROM `complains` WHERE `complains`.`id` = 10

    def set_complain
      @complain = Complain.find(params[:id])
---
SELECT  `complains`.* FROM `complains` WHERE `complains`.`id` = 13 LIMIT 1